In [30]:
import pandas as pd
import numpy as np

In [31]:
forum_users = {
    'User_ID': np.array([1, 2, 3, 4, 5]),
    'Username': ['Bogdan_s', 'Jane_Smith', 'Alex123', 'Bob56', 'Mark_Wilson'],
    'Age': [18, 35, 25, 38, 33],
    'Joined date': pd.to_datetime(['2032-01-01', '2032-02-10', '2032-01-19', '2032-01-25', '2032-03-15']),
    'Total Posts': [150, 230, 80, 420, 310],
    'Reputation': [500, 720, 200, 940, 500]
} 

df = pd.DataFrame(forum_users)    
df

   User_ID     Username  Age Joined date  Total Posts  Reputation
0        1     Bogdan_s   18  2032-01-01          150         500
1        2   Jane_Smith   35  2032-02-10          230         720
2        3      Alex123   25  2032-01-19           80         200
3        4        Bob56   38  2032-01-25          420         940
4        5  Mark_Wilson   33  2032-03-15          310         500

In [32]:
df['Language'] = 'English' # Добавление столбца с одинаковыми значениями
df

   User_ID     Username  Age Joined date  Total Posts  Reputation Language
0        1     Bogdan_s   18  2032-01-01          150         500  English
1        2   Jane_Smith   35  2032-02-10          230         720  English
2        3      Alex123   25  2032-01-19           80         200  English
3        4        Bob56   38  2032-01-25          420         940  English
4        5  Mark_Wilson   33  2032-03-15          310         500  English

In [33]:
df['Active'] = [True, True, False, True, False] 
df # Добавление столбца с разными значениями

,User_ID,Username,Age,Joined date,Total Posts,Reputation,Language,Active
0,1,Bogdan_s,18,2032-01-01,150,500,English,True
1,2,Jane_Smith,35,2032-02-10,230,720,English,True
2,3,Alex123,25,2032-01-19,80,200,English,False
3,4,Bob56,38,2032-01-25,420,940,English,True
4,5,Mark_Wilson,33,2032-03-15,310,500,English,False

In [34]:
total_comments = {
    'Total Comments': [320, 450, 120, 600, 410]
    }

df2 = pd.DataFrame(total_comments)
df2  # Создание второго датафрейма

   Total Comments
0             320
1             450
2             120
3             600
4             410

In [35]:
pd.concat([df, df2]) # Объединение двух датафреймов по строкам (по умолчанию) 
# ось = 0

,User_ID,Username,Age,Joined date,Total Posts,Reputation,Language,Active,Total Comments
0,1.0,Bogdan_s,18.0,2032-01-01,150.0,500.0,English,True,NaN
1,2.0,Jane_Smith,35.0,2032-02-10,230.0,720.0,English,True,NaN
2,3.0,Alex123,25.0,2032-01-19,80.0,200.0,English,False,NaN
3,4.0,Bob56,38.0,2032-01-25,420.0,940.0,English,True,NaN
4,5.0,Mark_Wilson,33.0,2032-03-15,310.0,500.0,English,False,NaN
0,NaN,NaN,NaN,NaT,NaN,NaN,NaN,NaN,320.0
1,NaN,NaN,NaN,NaT,NaN,NaN,NaN,NaN,450.0
2,NaN,NaN,NaN,NaT,NaN,NaN,NaN,NaN,120.0
3,NaN,NaN,NaN,NaT,NaN,NaN,NaN,NaN,600.0
4,NaN,NaN,NaN,NaT,NaN,NaN,NaN,NaN,410.0

In [36]:
df = pd.concat([df, df2], axis=1) # присоединение двух датафреймов по столбцам (ось = 1)
df # Объединение двух датафреймов по столбцам (ось = 1)

,User_ID,Username,Age,Joined date,Total Posts,Reputation,Language,Active,Total Comments
0,1,Bogdan_s,18,2032-01-01,150,500,English,True,320
1,2,Jane_Smith,35,2032-02-10,230,720,English,True,450
2,3,Alex123,25,2032-01-19,80,200,English,False,120
3,4,Bob56,38,2032-01-25,420,940,English,True,600
4,5,Mark_Wilson,33,2032-03-15,310,500,English,False,410

In [37]:
# пример df.drop(['Language']) # Удаление столбца без сохранения изменений в исходном датафрейме
# ось = 1 по умолчанию, так как поля по оси 1 такого нет, то удаление не происходит
# Исходный датафрейм остался без изменений

In [38]:
df.drop(['Language'], axis=1) # Удаление столбца

,User_ID,Username,Age,Joined date,Total Posts,Reputation,Active,Total Comments
0,1,Bogdan_s,18,2032-01-01,150,500,True,320
1,2,Jane_Smith,35,2032-02-10,230,720,True,450
2,3,Alex123,25,2032-01-19,80,200,False,120
3,4,Bob56,38,2032-01-25,420,940,True,600
4,5,Mark_Wilson,33,2032-03-15,310,500,False,410

In [39]:
df # Просмотр датафрейма после удаления столбца где видно что столбец остался

,User_ID,Username,Age,Joined date,Total Posts,Reputation,Language,Active,Total Comments
0,1,Bogdan_s,18,2032-01-01,150,500,English,True,320
1,2,Jane_Smith,35,2032-02-10,230,720,English,True,450
2,3,Alex123,25,2032-01-19,80,200,English,False,120
3,4,Bob56,38,2032-01-25,420,940,English,True,600
4,5,Mark_Wilson,33,2032-03-15,310,500,English,False,410

In [40]:
df.drop(['Language'], axis=1, inplace=True) # Удаление столбца с сохранением изменений в исходном датафрейме

In [41]:
df # Просмотр датафрейма после удаления столбца где видно что столбец удален

,User_ID,Username,Age,Joined date,Total Posts,Reputation,Active,Total Comments
0,1,Bogdan_s,18,2032-01-01,150,500,True,320
1,2,Jane_Smith,35,2032-02-10,230,720,True,450
2,3,Alex123,25,2032-01-19,80,200,False,120
3,4,Bob56,38,2032-01-25,420,940,True,600
4,5,Mark_Wilson,33,2032-03-15,310,500,False,410

In [42]:
df.drop([2, 3], inplace=True) # Удаление строк

In [43]:
df # Просмотр датафрейма после удаления столбца где видно что столбец удален

,User_ID,Username,Age,Joined date,Total Posts,Reputation,Active,Total Comments
0,1,Bogdan_s,18,2032-01-01,150,500,True,320
1,2,Jane_Smith,35,2032-02-10,230,720,True,450
4,5,Mark_Wilson,33,2032-03-15,310,500,False,410